native2ascii -encodage UTF-8 text_utf8.properties text.properties
#ERREURS RAPPORTEES PAR LA DAL:
#=>Erreurs generales
10000=Une tentative d'enregistrement d'informations inexistantes a eu lieu.
10001=Une erreur non g\u00E9r\u00E9e est survenue lors de l'enregistrement des informations.
#=>Erreurs Avis
10003=
10002=Identifiants invalides
10004=
10005=Impossible de supprimer l'article.
10006=Impossible de supprimer l'utilisateur.
10007=
10008=
10009=Aucun compte n'est associ\u00E9 \u00E0 ce pseudo
#ERREURS BLL:
#=>Erreurs Utilisateurs
20000=Le pseudo de l'utilisateur est obligatoire et ne doit pas d\u00E9passer 30 caracteres. Ne doit contenir que des caract\u00E8res alphanum\u00E9riques.
20001=Le nom de l'utilisateur est obligatoire et ne doit pas d\u00E9passer 30 caracteres
20002=Le prenom de l'utilisateur est obligatoire et ne doit pas d\u00E9passer 30 caracteres
20003=Le mail de l'utilisateur est obligatoire et ne doit pas d\u00E9passer 60 caracteres
20004=Le telephone ne doit pas d\u00E9passer 15 caract\u00E8res, contenir uniquement des nombres et \u00EAtre au format : +336XXXXXXXX
20005=La rue de l'utilisateur est obligatoire et ne doit pas d\u00E9passer 30 caracteres
20006=Le code postal de l'utilisateur est obligatoire et ne doit pas d\u00E9passer 10 caracteres
20007=La ville de l'utilisateur est obligatoire et ne doit pas d\u00E9passer 30 caracteres
20008=Le credit de l'utilisateur est forc\u00E9ment un entier et doit \u00EAtre sup\u00E9rieur \u00E0 z\u00E9ro
20009=Le statut administrateur est forc\u00E9ment vrai ou faux
20010=Cet identifiant est d\u00E9j\u00E0 pris. Veuillez en choisir un autre.
20011=Cet email est d\u00E9j\u00E0 li\u00E9 \u00E0 un compte.
20012=Le mot de passe d\u00E9passe la longueure maximale autoris\u00E9e (100 caract\u00E8res)
20013=Le mot de passe doit contenir au moins 8 caract\u00E8res dont au moins une minuscule, une majuscule, un chiffre. Les espaces ne sont pas accept\u00E9s.
20014=Le mot de passe saisi est incorrect.
20015=L'utilisateur n'existe pas.
20016=Impossible d'identifier l'utilisateur. Vous n'\u00EAtes pas connect\u00E9.
20017=Caract\u00E8res non valides. Ne doit contenir que des lettres.

#=>Erreurs Articles
20031=Le nom de l'article est obligatoire et ne doit pas d\u00E9passer 30 caract\u00E8res
20032=La desciption de l'article est obligatoire et ne doit pas d\u00E9passer 300 caract\u00E8res
20033=La date de d\u00E9but doit \u00EAtre \u00E9gale ou post\u00E9rieure \u00E0 la date du jour
20034=La date de fin doit \u00EAtre \u00E9gale ou post\u00E9rieure \u00E0 la date du jour
20035=Le prix initial doit \u00EAtre \u00E9gal ou sup\u00E9rieur \u00E0 0
20036=Le prix de vente doit \u00EAtre sup\u00E9rieur ou \u00E9gal au prix initial
#ERREURS RAPPORTEES PAR LES SERVLETS:
30000=Erreur dans l'id de l'article
30031=Le nom de l'article est obligatoire
30032=La desciption de l'article est obligatoire
30033=La date de d\u00E9but est obligatoire
30034=La date de fin est obligatoire
30035=Le prix initial est obligatoire
30036=Erreur sur le prix de vente
30037=La cat\u00E9gorie est obligatoire
30040=La rue est obligatoire
30041=Le code postal est obligatoire
30042=La ville est obligatoire
#=>Erreurs Encheres
30043=Le montant de l'ench\u00E8re doit \u00EAtre positif et sup\u00E9rieur \u00E0 la derni\u00E8re offre


#30010=L'heure doit etre dans un format valide (hh:mm)
30012= Identifiants invalides
30013=Cette adresse email n'est associ\u00E9e \u00E0 aucun compte
30001=Le pseudo de l'utilisateur est obligatoire
30002=Le nom de l'utilisateur est obligatoire
30003=Le pr\u00E9nom de l'utilisateur est obligatoire
30004=La rue est obligatoire
30005=Le code postal est obligatoire
30006=La ville est obligatoire
30007=Le mot de passe est obligatoire
30008=La confirmation du mot de passe est obligatoire
30009=Les mots de passe doivent \u00EAtre identiques
30010=L'email est obligatoire
30011=Caract\u00E8res non valides. Nom, pr\u00E9nom et ville ne doivent pas contenir de caract\u00E8res num\u00E9riques ni de caract\u00E8res sp\u00E9ciaux.


