native2ascii -encodage UTF-8 text_utf8.properties text.properties
#ERREURS RAPPORTEES PAR LA DAL:
#=>Erreurs generales
10000=Une tentative d'enregistrement d'informations inexistantes a eu lieu.
10001=Une erreur non g\u00E9r\u00E9e est survenue lors de l'enregistrement des informations.
10002=L'utilisateur n'existe pas. Lecture impossible.
10003=Erreur lors de la lecture de l'utilisateur.
10004=Mise \u00E0 jour impossible.
10005=Suppression impossible.
10006=Impossible de supprimer l'utilisateur. Le compte \u00E0 supprimer ne doit pas comporter de ventes ou d'ench\u00E8res en cours.
10007=Impossible de lire l'ench\u00E8re correspondant \u00E0 cet article.
10008=Impossible de lire le retrait correspondant \u00E0 cet article.
10009=
10010=Erreur lors de la lecture des cat\u00E9gories.
10032=Echec lors de la lecture des articles.
10033=Echec lors de la recherche par filtre.
10034=Article inexistant.
10035=Impossible de supprimer l'article.
#ERREURS BLL:
#=>Erreurs Utilisateurs
20000=Le pseudo de l'utilisateur est obligatoire et ne doit pas d\u00E9passer 30 caracteres. Ne doit contenir que des caract\u00E8res alphanum\u00E9riques.
20001=Le nom de l'utilisateur est obligatoire et ne doit pas d\u00E9passer 30 caracteres
20002=Le prenom de l'utilisateur est obligatoire et ne doit pas d\u00E9passer 30 caracteres
20003=Le mail de l'utilisateur est obligatoire et ne doit pas d\u00E9passer 60 caracteres
20004=Le telephone ne doit pas d\u00E9passer 15 caract\u00E8res, contenir uniquement des nombres et \u00EAtre au format : +336XXXXXXXX
20005=La rue de l'utilisateur est obligatoire et ne doit pas d\u00E9passer 30 caracteres
20006=Le code postal de l'utilisateur est obligatoire et ne doit pas d\u00E9passer 10 caracteres
20007=La ville de l'utilisateur est obligatoire et ne doit pas d\u00E9passer 30 caracteres
20008=Le credit de l'utilisateur est forc\u00E9ment un entier et doit \u00EAtre sup\u00E9rieur \u00E0 z\u00E9ro
20009=Le statut administrateur est forc\u00E9ment vrai ou faux
20010=Cet identifiant est d\u00E9j\u00E0 pris. Veuillez en choisir un autre.
20011=Cet email est d\u00E9j\u00E0 li\u00E9 \u00E0 un compte.
20012=Le mot de passe d\u00E9passe la longueure maximale autoris\u00E9e (100 caract\u00E8res)
20013=Le mot de passe doit contenir au moins 8 caract\u00E8res dont au moins une minuscule, une majuscule, un chiffre. Les espaces ne sont pas accept\u00E9s.
20014=Le mot de passe saisi est incorrect.
20015=L'utilisateur n'existe pas.
20016=Impossible d'identifier l'utilisateur. Vous n'\u00EAtes pas connect\u00E9.
20017=Caract\u00E8res non valides. Ne doit contenir que des lettres.
20018=Carcat\u00E8res non valide. Le code postal ne doit contenir que des chiffres.
20019=Aucun compte n'est associ\u00E9 \u00E0 ce pseudo.
20020=L'adresse fournie n'est pas valide.
#=>Erreurs Articles
20031=Le nom de l'article est obligatoire et ne doit pas d\u00E9passer 30 caract\u00E8res
20032=La description de l'article est obligatoire et ne doit pas d\u00E9passer 300 caract\u00E8res
20033=La date de d\u00E9but doit \u00EAtre \u00E9gale ou post\u00E9rieure \u00E0 la date du jour
20034=La date de fin doit \u00EAtre \u00E9gale ou post\u00E9rieure \u00E0 la date du jour
20035=Le prix initial doit \u00EAtre \u00E9gal ou sup\u00E9rieur \u00E0 0
20036=Le prix de vente doit \u00EAtre sup\u00E9rieur ou \u00E9gal au prix initial
#=>Erreurs Ench\u00E8res
20038=La date d'ench\u00E8re est d\u00E9pass\u00E9e 
20039=Le montant de l'ench\u00E8re doit \u00EAtre sup\u00E9rieur au prix affich\u00E9.
20040=L'utilisateur n'est pas connect\u00E9
20041=Cr\u00E9dit utilisateur insuffisant 
20042=Article incorrect

#ERREURS RAPPORTEES PAR LES SERVLETS:
#=>Erreurs Articles
30000=Erreur dans l'id de l'article
30031=Le nom de l'article est obligatoire
30032=La description de l'article est obligatoire
30033=La date de d\u00E9but est obligatoire
30034=La date de fin est obligatoire
30035=La mise \u00E0 prix est obligatoire et doit \u00EAtre positive
30036=Erreur sur le prix de vente
30037=La cat\u00E9gorie est obligatoire
30038= Veuillez selectionner un article pour afficher les informations de l'ench\u00E8re corresondante
30040=La rue est obligatoire
30041=Le code postal est obligatoire
30042=La ville est obligatoire
#=>Erreurs Encheres
30043=Le montant de l'ench\u00E8re doit \u00EAtre positif et sup\u00E9rieur au prix actuellement affich\u00E9
30044=La date d'ench\u00E8re de l'article est d\u00E9pass\u00E9e 
30045=Compte utilisateur non trouv\u00E9 - Vous devez \u00EAtre connect\u00E9 pour pouvoir encherir
30046=Cr\u00E9dit insuffisant - Veuillez recharger votre compte avant d'encherir 
#=>Erreurs Utilisateurs

30001=Le pseudo de l'utilisateur est obligatoire
30002=Le nom de l'utilisateur est obligatoire
30003=Le pr\u00E9nom de l'utilisateur est obligatoire
30004=La rue est obligatoire
30005=Le code postal est obligatoire
30006=La ville est obligatoire
30007=Le mot de passe est obligatoire
30008=La confirmation du mot de passe est obligatoire
30009=Les mots de passe doivent \u00EAtre identiques
30010=L'email est obligatoire
30011=Caract\u00E8res non valides. Nom, pr\u00E9nom et ville ne doivent pas contenir de chiffres ni de caract\u00E8res sp\u00E9ciaux.
30012= Identifiants invalides
30013=Cette adresse email n'est associ\u00E9e \u00E0 aucun compte
30014=Le format du num\u00E9ro de t\u00E9l\u00E9phone n'est pas valide.
30015=Le code postal n'est pas valide. Ne doit contenir que des chiffres.
30016=Veuillez selectionner au moins un champ parmi les filtres.

